using HomeWork_5;

//Task25_1.Run(); // исправила ошибку 
Task34.Run();
Task36.Run();
Task38.Run();


// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2

// Задача 36.Задайте одномерный массив, заполненный случайными числами.
// Найдите сумму элементов с нечётными индексами.
// [3, 7, 23, 12] -> 19[-4, -6, 89, 6]-> 0

// Задача 38: Задайте массив вещественных чисел.
// Найдите разницу между максимальным и минимальным элементов массива.
// [3,21 7,04 22,93 -2,71 78,24] -> max = 78,24, min = -2,71, difference = 80,95

